const GroupCols = require("./GroupCols");
const MergedCustom = {
    Type: "نوع غير متوفر الرجاء التاكد من النوع",
    // Type: "Invalid Type Provided Please Make Sure The Type Is Correct",
    RequiredValue: "القيمة مطلوبة"
};
const DataCols = Object.fromEntries(
    GroupCols.DataCols.map((item) => [item, `${item.replace("Data", "")} مطلوب`])
);
const DetailCols = Object.fromEntries(
    GroupCols.Detail.map((item) => [item, `${item.replace("Detail", "")} مطلوب`])
);
const Lang = {
    APP_NAME: "Adham Fathallah",
    SUCCESS: {
        SUCCESS: "نجاح",
        CREATED: "تم الإنشاء",
        UPDATED: "تم التحديث",
        DELETED: "تم الحذف",
        FORGET: "يرجى التحقق من الواتساب لإتمام الخطوة التالية",
        LOGIN: "مرحباً بعودتك {ClientName} إلى {AppName}",
        LOGIN_UPDATE: "تم تحديث الحساب بنجاح أهلاً بك مرة أخرى {ClientName} في {AppName}",
        VERIFED: "تهانينا {ClientName}! تم التحقق من حسابك بنجاح. استمتع بالخدمات المجانية",
        REGISTERED: "تم تسجيل الحساب. يرجى التحقق من الواتساب",
        NO_CHANGES: "لا توجد تغييرات",
        MESSAGE_SENT: "تم إرسال الرسالة بنجاح إلى {To}"
    },
    MESSAGES: {
        ForgetPasswordMessage: `
    مرحبًا بك في موقع {AppName}!
    لقد تلقينا طلبًا لاستعادة كلمة المرور الخاصة بحسابك. إذا لم تطلب استعادة كلمة المرور، يمكنك تجاهل هذه الرسالة بأمان.
    لاستعادة كلمة المرور الخاصة بك، يرجى استخدام كود التحقق التالي:
    كود التحقق: {Code}
    يرجى ملاحظة أن كود التحقق هذا صالح لمدة ساعتين فقط. بعد ذلك، ستحتاج إلى طلب كود جديد إذا كنت لا تزال ترغب في استعادة كلمة المرور.
    إذا كنت بحاجة إلى أي مساعدة إضافية، لا تتردد في التواصل مع فريق الدعم لدينا.
    نتمنى لك يومًا سعيدًا!
    `,
        CreateMessage: `
    مرحبًا بك في موقع {AppName}!
    شكرًا لانضمامك إلينا. 
    نحن متحمسون لأنك أصبحت جزءًا من مجتمعنا.
    لتفعيل حسابك، يرجى استخدام كود التحقق أدناه:
    كود التحقق: {Code}
    سيتم انتهاء صلاحية كود التحقق بعد ساعتين
    إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة، لا تتردد في الاتصال بفريق الدعم لدينا.
    نتمنى لك تجربة رائعة معنا!
    `,
        ResendVerifyCode: `
    مرحبًا بك مرة اخري {AppName}!
    تم اعادة انشاء كود التحقق من جديد بناء علي طلبكم
    لتفعيل حسابك، يرجى استخدام كود التحقق أدناه:
    كود التحقق: {Code}
    سيتم انتهاء صلاحية كود التحقق بعد ساعتين
    إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة، لا تتردد في الاتصال بفريق الدعم لدينا.
    نتمنى لك تجربة رائعة معنا!
    `,
        LoginSendCode: `
  مرحبًا بك مرة أخرى 
  في  {AppName}
  شكرًا لكونك جزءًا من مجتمعنا.
  نود أن نطلب منك تحديث بياناتك
  لضمان تقديم أفضل خدمة ممكنة.
  لتأكيد التحديثات،
  يرجى استخدام كود التحقق أدناه
  كود التحقق: {Code}
  إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة،
  لا تتردد في الاتصال بفريق الدعم لدينا.
  شكرًا لتعاونك!
`
    },
    VALIDATION: {
        NOT_ALLOWED: "الحقل ( {Field} ) غير مسموح",
        REQUIRED_FIELD: "الحقل ( {Field} ) مطلوب ولا يمكن تركه فارغًا",
        INVALIDKEY: "الحقل ( {Field} ) يحتوي على بيانات غير مسموح بها",
        ALLOWED_DATE_ONLY: "الحقل ( {Field} ) يجب أن يكون تاريخًا",
        ALLOWED_ARRAY: "الحقل ( {Field} ) يجب أن يكون مصفوفة",
        ALLOWED_STRING: "الحقل ( {Field} ) يجب أن يكون نصًا",
        ALLOWED_BOOLEAN: "الحقل ( {Field} ) يجب أن يكون من بين (true, false)",
        ARRAY_MIN: "الحقل ( {Field} ) لا يمكن أن يحتوي على أقل من {min} عناصر",
        ARRAY_MAX: "الحقل ( {Field} ) لا يمكن أن يحتوي على أكثر من {max} عناصر",
        REQUIRED: {
            FromId: "مطلوب من",
            ToId: "مطلوب إلى",
            File: "الملف مطلوب",
            Data: "البيانات مطلوبة",
            ClientConnection: "الاتصال مطلوب",
            Method: "مطلوب رقم الهاتف أو رقم الهاتف الثاني",
            ClientPhoneNumber: "مطلوب رقم الهاتف",
            ClientPhoneNumber2: "مطلوب رقم الهاتف الثاني",
            ClientPassword: "مطلوب كلمة المرور",
            ClientCode: "مطلوب الكود",
            Commercial: "البيانات مطلوبة",
            UType: "نوع المستخدم مطلوب",
            DataSectionId: "القسم مطلوب",
            BlacklistNumber: "الرقم مطلوب",
            BlacklistIpAdress: "عنوان IP مطلوب",
            BlacklistUserId: "مطلوب معرّف المستخدم",
            ClientId: "المعرف مطلوب",
            ClientName: "الاسم مطلوب",
            ...DataCols,
            ...DetailCols
        },
        CUSTOM: {
            ClientPassword: "يجب أن تحتوي كلمة المرور على 6 أحرف على الأقل وتضم رقمًا وحرفًا",
            ClientVrifyTypes: `نوع التحقق يجب أن يكون من بين ("Online", "Offline")`,
            Type: MergedCustom.Type,
            UType: MergedCustom.Type,
            ClientConnection: MergedCustom.Type
        },
        PATTERN: {}
    },
    ERRORS: {
        EMERGENCY_MSG: `
           🛑 رسالة طوارئ
                ※ الخادم : {Server}
                ※ الخطأ : {Reason}
				※ الكود : 199404
                ※ التاريخ : ${new Date().toLocaleString()}
                ※ المرسل: ${process.env.AGENT}
                ※ من : ${process.env.NODE_ENV}
        `,
        SERVER_IS_DOWN: "الخادم متوقف",
        WA_EMERGENCY_MSG: "لا يمكن إرسال الرسالة، يرجى الاتصال بالمسؤول مع هذا الكود: 199405",
        SERVER_ERROR: "حدث خطأ غير معروف. إذا استمرّ، يرجى التواصل مع المشرفين، كود الخطأ: ",
        CODE_EXPIRED: "عذرًا، الكود منتهي. يرجى طلب كود جديد",
        INVALID_CODE: "عذرًا، الكود غير صحيح. يرجى التأكد من الكود",
        ALLOWED_ONLY_FOR_ADMIN: "عذرًا، هذه العملية غير مسموحة لك",
        MISMATCH_PREMISSIONS: "عذرًا، لا تملك الصلاحيات اللازمة",
        INVALID_DATE: "التاريخ المدخل غير صالح أو التنسيق غير صحيح",
        DATE_IS_ALREADY_EXPIRED: "عذرًا، التاريخ منتهي",
        DATE_IS_SAME_AS_TODAY: "عذرًا، التاريخ يطابق اليوم",
        NO_CONFIGRE_IMPORT: "لا يوجد استيراد لهذا النوع حالياً",
        LIST_MESSAGE_ALL_EMPTY: "عذرًا، لا يوجد ملفات أو رسائل للإرسال",
        PASSWORD_NOT_MATCH_CONFIRM: "كلمة المرور لا تتطابق مع التأكيد. حاول مجددًا",
        PASSWORD_NOT_MATCH_OLD: "كلمة المرور لا تتطابق مع كلمة المرور القديمة. حاول مجددًا",
        // PASSWORD_NOT_MATCH_OLD: "Password Not Match Old Password Please Try Again",
        Client_NOT_ACTIVE: "عذرًا، حسابك غير نشط. يرجى التواصل مع المسؤول",
        Client_ALREADY_ACTIVE: "هذا الحساب نشط بالفعل، لا توجد تغييرات معلقة",
        Client_EXPIRED: "عذرًا، حسابك منتهي. يرجى التواصل مع المسؤول",
        Client_NOT_RESETABLE: "عذرًا، هذا الحساب لا يمكن إعادة تعيينه",
        Client_NOT_UPDATABLE:
            "عذرًا، لا يمكن تحديث هذا الحساب. إذا كان ذلك خطأ، يرجى التواصل مع المسؤول",
        NOT_ALLOWED_TO_USE_SERVICE:
            "عذرًا، قد لا يكون حسابك قادرًا على استخدام الخدمة. يرجى التواصل مع المسؤول للحصول على مزيد من المعلومات",
        Client_TRIAL_DAYS_LETH_THAN_ONE: "عذرًا، يجب إضافة يوم على الأقل في فترة التجربة",
        INCORRECT_CREADENTIALS: "كلمة المرور أو رقم الهاتف غير صحيح",
        INCORRECT_OLD_PASSWORD: "كلمة المرور القديمة غير صحيحة",
        INCORRECT_CODE: "رقم الهاتف أو البريد الإلكتروني غير صحيح",
        ACCOUNT_INACTIVE: "حسابك غير نشط، يرجى تفعيله. تحقق من الواتساب",
        Client_RESEND_LIMIT:
            "عذرا. لقد استنفذت عدد مرات الارسال المسموح بها. يرجى التواصل مع المسؤول للحصول على مزيد من المعلومات",
        ACCOUNT_UN_COMPLETED: "حسابك غير مكتمل، يرجى تحديث المعلومات أدناه",
        ClientPhoneNumber: "رقم الهاتف مأخوذ بالفعل",
        ORIGIN_NOT_ALLOWED: "اتصال غير مصرح به",
        IP_NOT_ALLOWED: "عنوان IP غير مسموح",
        NO_TOKEN: "لا يوجد بينات اعتماد يرجي اعادة تسجيل الدخول",
        INVALID_TOKEN: "بينات الاعتماد غير صالحة او منتهية الصلاحيه يرجى اعادة تسجيل الدخول",
        INVALID_API_KEY: "معرّف المثيل مطلوب",
        INVALID_SECRET: "مفتاح السر مطلوب",
        INVALID_AUTHORIZATION: "التفويض المقدم غير صالح",
        // ==================== AppData ====================
        NO_DETAIL_DATA: "لا يوجد بينات لهذا المجمع/المشروع",
        FETCH_RETRY : "جاري محاولة جلب بيناتك",
        WHATSAPP_ACCOUNT_NOT_EXISTS: `لا يوجد حساب واتساب موجود لـ {SessionKey}. يرجى التأكد من أنك تستخدم الرقم الصحيح`,
    }
};

module.exports = Lang;
