const GroupCols = require("./GroupCols");
const MergedCustom = {
    Type: "نوع غير متوفر الرجاء التاكد من النوع",
    RequiredValue: "القيمة مطلوبة"
};
const RequiredWithName = Object.fromEntries(
    GroupCols.RequiredName.map((item) => [item, "الاسم مطلوب"])
);
const RequiredWithId = Object.fromEntries(
    GroupCols.RequiredId.map((item) => [item, "المعرف مطلوب"])
);
const DataCols = Object.fromEntries(
    GroupCols.DataCols.map((item) => [item, `${item.replace("Data", "")} مطلوب`])
);
const DetailCols = Object.fromEntries(
    GroupCols.DetailCols.map((item) => [item, `${item.replace("Detail", "")} مطلوب`])
);
const PhasCols = Object.fromEntries(
    GroupCols.PhasCols.map((item) => [item, `${item.replace("Phas", "")} Required`])
);
const Lang = {
    APP_NAME: "Master",
    SUCCESS: {
        SUCCESS: "عملية ناجحة",
        CREATED: "تم الانشاء بنجاح",
        UPDATED: "تم التحديث بنجاح",
        DELETED: "تم الحذف بنجاح",
        FORGET: "يرجي فحص الواتساب او البريد الالكتروني لاكمال العملية",
        REGISTERED: "تم انشاء الحساب بنجاح يرجي ارسال بينات التفعيل علي الواتساب لتنشيط الحساب",
        REGISTERED_TRIAL: "تم انشاء احساب بنجاح ولديك يومين مجاني للتجربة",
        REGISTERED_EVENT:
            "مرحبا يا عزيزي العميل، تم التحقق من بياناتك  \n و تم تنشيط حسابك , يوما سعيدا",
        NO_CHANGES: "لا يوجد أي تغييرات",
        MESSAGE_SENT: "تم ارسال الموقع بنجاح",
        PENDING_SEND_FAILD: "تم قبول المستخدم بنجاح وفشل في ارسال الرسالة بسبب : ( {Reason} )"
    },
    VALIDATION: {
        NOT_ALLOWED: "الحقل ( {Field} ) غير مسموح به",
        REQUIRED_FIELD: "الحقل ( {Field} ) مطلوب ولا يمكن أن يكون فارغًا",
        INVALIDKEY: "الحقل ( {Field} ) يحتوي على قيمة غير مسموح بها",
        ALLOWED_DATE_ONLY: "الحقل ( {Field} ) يجب أن يكون تاريخًا",
        ALLOWED_ARRAY: "الحقل ( {Field} ) يجب أن يكون مصفوفة",
        UserPlan: "يجب تقديم أحد الحقلين UserPlan أو UserExpiry، ويجب أن يكون الآخر فارغًا.",
        ALLOWED_STRING: "الحقل ( {Field} ) يجب أن يكون نصًا",
        ARRAY_MIN: "الحقل ( {Field} ) لا يمكن أن يحتوي على أقل من {min} عنصر",
        ARRAY_MAX: "الحقل ( {Field} ) لا يمكن أن يحتوي على أكثر من {max} عنصر",
        REQUIRED: {
            FromId: "الحقل من مطلوب",
            ToId: "الحقل إلى مطلوب",
            File: "الملف مطلوب",
            Data: "البيانات مطلوبة",
            // ================= User =================
            UserDevice: "الجهاز مطلوب",
            UserConnection: "الاتصال مطلوب",
            //  ====== AUTH (Login - Reqister - Forget) ========
            Method: "البريد الإلكتروني أو الكود مطلوب",
            Password: "كلمة المرور مطلوبة",
            UserEmail: "البريد الإلكتروني مطلوب",
            UserPhoneNumber: "رقم الهاتف مطلوب",
            UserPassword: "كلمة المرور مطلوبة",
            UserOldPassword: "كلمة المرور القديمة مطلوبة",
            UserRoleId: "رقم الدور مطلوب",
            UserCompanyName: "اسم الشركة مطلوب",
            UserSubUsersCount: "عدد المستخدمين مطلوب ويجب أن يكون أكبر من 0",
            UserPlan: "الخطة مطلوبة",
            UserSections: "الأقسام مطلوبة",
            UserForgetPasswordCode: "الكود مطلوب",
            UserExpiry: "تاريخ الانتهاء مطلوب",
            UserSupport: "الدعم مطلوب",
            Residential: "السكني مطلوب",
            Commercial: "التجاري مطلوب",
            UType: "نوع المستخدم مطلوب",
            Redirct: "إعادة التوجيه مطلوبة",
            // ================= Messages =================
            SessionKey: "الجلسة مطلوبة",
            To: "إلى مطلوب",
            Message: "الرسالة مطلوبة",
            Url: "الرابط مطلوب",
            Type: "النوع مطلوب",
            Filename: "اسم الملف مطلوب",
            FileUrl: "رابط الملف مطلوب",
            FileName: "اسم الملف مطلوب",
            // ================= Session =================
            Webhook: "الويب هوك مطلوب",
            WebhookUrl: "رابط الويب هوك مطلوب",
            Base64: "Base64 مطلوب",
            Number: "الرقم مطلوب",
            // ============================================ FOR ADMIN ============================================
            // ================= Section =================
            DataSectionId: "القسم مطلوب",
            // ================= City =================
            CityTypesResidential: "نوع بيانات السكني مطلوبة",
            CityTypesCommercial: "نوع بيانات التجاري مطلوبة",
            // ================= Area =================
            AreaCityId: "رقم المدينة مطلوب",
            // ================= Note =================
            NoteValue: "القيمة مطلوبة",
            NoteDate: "التاريخ مطلوب",
            NoteSupport: "الدعم مطلوب",
            NoteUserId: "رقم المستخدم مطلوب",
            // ================= Blacklist =================
            BlacklistNumber: "الرقم مطلوب",
            BlacklistIpAdress: "عنوان IP مطلوب",
            BlacklistUserId: "رقم المستخدم مطلوب",
            // ================= Phas =================
            PhasCompoundId: "رقم المجمع مطلوب",
            // ================= PaymentPlan =================
            PaymentPlanPhasId: "المرحلة مطلوبة",
            PaymentPlanValue: MergedCustom.RequiredValue,
            // ================= Compound =================
            DeveloperId: "معرف المطور مطلوب",
            // ================= SubType =================
            SubTypeTypeId: "معرف النوع مطلوب",
            // ================= Validation By Groups =================
            ...RequiredWithId,
            ...RequiredWithName,
            ...DataCols,
            ...DetailCols,
            ...PhasCols,
            ContactName: "اسم الاتصال مطلوب",
            ContactNumber: "رقم الاتصال مطلوب",
            ContactDeveloperId: "معرف المطور مطلوب",
            ContactUserId: "معرف المستخدم مطلوب"
        },
        CUSTOM: {
            // ----------------- user -----------------
            UserPassword: "كلمة المرور يجب أن تكون على الأقل 6 أحرف وتحتوي على رقم واحد وحرف واحد",
            ClientPassword: "كلمة المرور يجب أن تكون على الأقل 6 أحرف وتحتوي على رقم واحد وحرف واحد",
            UserVrifyTypes: `نوع التحقق يجب أن يكون أحد الخيارات ("Online", "Offline")`,
            Type: MergedCustom.Type,
            UType: MergedCustom.Type,
            UserConnection: MergedCustom.Type,
            SessionKey: "مفتاح الجلسة يجب أن يكون نصًا أو رقمًا ولا يمكن أن يكون فارغًا",
            DeleteAll:
                "حقل حذف الكل يجب أن يكون من نوع Boolean (true أو false) ولا يمكن أن يكون فارغًا",
            ImportFile: "لا يوجد ملف للاستيراد"
        },
        PATTERN: {}
    },
    ERRORS: {
        // ============== EMERGENCY ERRORS ====================
        EMERGENCY_MSG: `
           🛑 Emergency 
                ※ Server : {Server} 
                ※ Error : {Reason}
                ※ Date : ${new Date().toLocaleString()}
                ※ Reporter: ${process.env.AGENT}
                ※ From : ${process.env.NODE_ENV}
        `,
        // ================ SERVER ERROR ================
        SERVER_ERROR:
            "حدث خطأ غير معروف، إذا لم يتم حل المشكلة في المرة القادمة يرجى الكتابة إلى المشرفين، كود الخطأ: ",
        CDN_UNAVIALABLE: "الوسائط غير متوفرة، يرجى الاتصال بالمسؤول",
        //  ============== GLOBAL ERRORS ====================
        CODE_EXPIRED: "عذرًا، الكود منتهي الصلاحية، يرجى طلب كود جديد",
        ALLOWED_ONLY_FOR_ADMIN: "عذرًا، هذا الإجراء غير مسموح لك",
        MISMATCH_PREMISSIONS: "عذرًا، ليس لديك الصلاحيات اللازمة",
        INVALID_DATE: "التاريخ المقدم غير صالح أو التنسيق غير صحيح",
        DATE_IS_ALREADY_EXPIRED: "عذرًا، لكن التاريخ منتهي الصلاحية بالفعل",
        DATE_IS_SAME_AS_TODAY: "عذرًا، ولكن التاريخ هو نفسه تاريخ اليوم",
        NO_CONFIGRE_IMPORT: "لا يوجد استيراد لهذا النوع حاليًا",
        LIST_MESSAGE_ALL_EMPTY: "عذرًا، لا توجد ملفات أو رسائل لإرسالها",
        // ListMessage
        // ============== USER ERRORS =================
        USER_CITY_EMPTY: "يجب عليك اختيار المدن لـ {Section} إذا قمت باختيارها",
        User_DEVICE_LIMIT: "تم تجاوز حد الأجهزة، يرجى الاتصال بالمسؤول لزيادة الحد",
        User_NOT_ACTIVE: "عذرًا، حسابك غير مفعل، يرجى الاتصال بالمسؤول",
        User_ALREADY_ACTIVE: "عذرًا، هذا الحساب مفعل بالفعل ولا يُسمح بمزيد من التعديلات المعلقة",
        User_EXPIRED: "عذرًا، حسابك منتهي الصلاحية، يرجى الاتصال بالمسؤول",
        User_NOT_RESETABLE: "عذرًا، لا يمكن إعادة تعيين هذا الحساب",
        User_NOT_UPDATABLE:
            "عذرًا، لا يمكن تحديث هذا الحساب، إذا كان هذا خطأ يرجى الاتصال بالمسؤول",
        User_TRIAL_DAYS_LETH_THAN_ONE: "عذرًا، يجب إضافة يوم واحد على الأقل في فترة التجربة",
        INCORRECT_PASSWORD: "كلمة المرور أو رقم الهاتف غير صحيح",
        INCORRECT_OLD_PASSWORD: "كلمة المرور القديمة غير صحيحة",
        INCORRECT_CODE: "رقم الهاتف أو البريد الإلكتروني غير صحيح",
        UserPhoneNumber: "رقم الهاتف مستخدم بالفعل",
        // ============== Authorization Failed ====================
        ORIGIN_NOT_ALLOWED: "الاتصال غير مسموح به",
        IP_NOT_ALLOWED: "عنوان IP غير مسموح به",
        NO_TOKEN: "لا يوجد بينات اعتماد يرجي اعادة تسجيل الدخول",
        INVALID_TOKEN: "بينات الاعتماد غير صالحة او منتهية الصلاحيه يرجى اعادة تسجيل الدخول",
        INVALID_AUTHORIZATION: "تم تقديم تفويض غير صالح",
        // ================ WHATSAPP CONNECTION ================
        NOT_CONNECTED: "لا توجد جلسة متصلة",
        NO_CONNECTION: "لم يتم العثور على اتصال لـ {key}، يرجى التأكد من أنك متصل",
        WHATSAPP_ACCOUNT_NOT_EXISTS: `لا يوجد حساب واتساب موجود لـ {SessionKey} يرجى التأكد من استخدام الرقم الصحيح`,
        ALREADY_CONNECTED: "الجلسة متصلة بالفعل",
        Session_NOT_CONNECTED: "يرجى توصيل الجلسة عبر مسح رمز QR",
        FAILD_SEND: "فشل في إرسال الرسالة",
        INVALID_ACTION: "عذرًا، هذا الإجراء غير مسموح",
        // ============== NOT FOUND ====================
        Route_NOT_FOUND: " نأسف الرابط المطلوب غير موجود او ربما تم حذفه",
        File_NOT_FOUND: " الملف المطلوب غير موجود او ربما تم حذفه",
        Cmd_NOT_FOUND: " الامر المطلوب غير موجود او ربما تم حذفه",
        Admin_NOT_FOUND: " المدير المطلوب غير موجود او ربما تم حذفه",
        User_NOT_FOUND: " المستخدم المطلوب غير موجود او ربما تم حذفه",
        Client_NOT_FOUND: " العميل المطلوب غير موجود او ربما تم حذفه",
        City_NOT_FOUND: " المدينة المطلوب غير موجود او ربما تم حذفه",
        Note_NOT_FOUND: " الملاحظة المطلوب غير موجود او ربما تم حذفه",
        BlackList_NOT_FOUND: " المستخدم المطلوب غير موجود او ربما تم حذفه",
        Phas_NOT_FOUND: " المرحلة المطلوبة غير موجودة او ربما تم حذفه",
        Compound_NOT_FOUND: " المشروع المطلوب غير موجود او ربما تم حذفه",
        Area_NOT_FOUND: " المنطقة المطلوبة غير موجودة او ربما تم حذفه",
        Developer_NOT_FOUND: " المطور المطلوب غير موجود او ربما تم حذفه",
        Session_NOT_FOUND: " الجلسة المطلوبة غير موجودة او ربما تم حذفه",
        Section_NOT_FOUND: " القسم المطلوب غير موجود او ربما تم حذفه",
        AppData_NOT_FOUND: " البيانات المطلوبة غير موجودة او ربما تم حذفه",
        Details_NOT_FOUND: " التفاصيل المطلوبة غير موجودة او ربما تم حذفه",
        Contact_NOT_FOUND: " الاتصال المطلوب غير موجود او ربما تم حذفه",
        Device_NOT_FOUND: " الجهاز المطلوب غير موجود او ربما تم حذفه",
        MediaTracker_NOT_FOUND: " ",
        //  ==================== EXIST ==================
        AdminEmail_EXIST: "البريد الإلكتروني غير متوفر",
        UserEmail_EXIST: "البريد الإلكتروني غير متوفر",
        UserPhoneNumber_EXIST: "رقم الهاتف غير متوفر",
        ClientPhoneNumber_EXIST: "رقم الهاتف/رقم الهاتف 2 غير متوفر",
        Admin_EXIST: "المشرف غير متوفر",
        Client_EXIST: "العميل غير متوفر",
        User_EXIST: "المستخدم غير متوفر",
        City_EXIST: "المدينة غير متوفر",
        Note_EXIST: " الملاحظة غير متوفر",
        BlackList_EXIST: " المستخدم في القائمة السوداء بالفعل",
        Phas_EXIST: " المرحلة غير متوفر",
        Compound_EXIST: "المجمع غير متوفر",
        Area_EXIST: " المنطقة غير متوفر",
        Developer_EXIST: " المطور غير متوفر",
        Session_EXIST: " الجلسة غير متوفر",
        Section_EXIST: " القسم غير متوفر",
        Data_EXIST: " البيانات غير متوفر",
        Detail_EXIST: " التفاصيل غير متوفر",
        Contact_EXIST: " التواصل غير متوفر",
        Consultant_EXIST: " المستشار غير متوفر",
        BALCKLIST_MISSING_FIELDS : "لا يوجد بينات كافية لاضافة/تعديل الى القائمة السوداء",
        RATE_LIMIT : "لقد تجاوزت الحد الاقصى للطلبات لهذا الطلب، يرجى المحاولة في {{Time}}",
        PERMISSION_UPDATE_FAILED : "فشل التحديث في الصلاحيات بسبب : {Reason}",
    }
};
module.exports = Lang;
