const CompanyName = "AF Property";
const Sidebar = {
    LABEL: "البحث بواسطة",
    SORTING: "الترتيب",
    CITY_SCAPE_SORTING: "الترتيب بواسطة سيتي سكايب",
    SLUG_BUTTON: " التفاصيل",
    TITLE: {
        CITY: "المدن",
        SUB_TYPES: "النوع",
        DEVELOPER: "المطور",
        COMPOUND: "كمبوند",
        PROJECT: "مشروع",
        THE_COMPOUND: "الكمبوند",
        THE_PROJECT: "المشروع",
        BEDROOMS: "الغرف",
        FINISHING: "التشطيب",
        INSTALLMENT_YEARS: "سنوات التقسيط",
        DELIVERY: "التسليم",
        DOWN_PAYMENT: "الدفعة الاولى",
        UNIT_TOTAL_PRICE: "سعر الوحدة",
        BUILT_UP_AREA: "مساحة البناء",
        CONTACT_WITH_TEAM_1: "فريق ادهم فتح الله",
        CONTACT_WITH_TEAM: "تواصل مع \n فريق ادهم فتح الله",
        CONTACT_WITH_DEVELOPER: "تواصل مع \n {Developr}",
        LAYOUTS_BUTTON: "التخطيطات",
        MIN_PRICE: "السعر الادنى",
        ExtraBenefits: "مميزات اضافية",
        Consultants: "الاستشاريين",
        Engineering: "استشاري هندسي",
        Executive: "استشاري تنفيذي",
        Management: "شركة الإدارة",
        Architecture: "استشاري معماري"
    },
    WORDS: {
        DELIVERY: "سنة",
        YEARS: "سنة",
        DELIVERY_TITLE: " / التسليم {Delivery}",
        RESIDENCE_DATE: "",
        ACR: "فدان",
        PAYMENT_PLAN: "خطة الدفع",
        DELIVERY_OPTION: "R T M",
        BOOKING_OPEN: "تم فتح باب الحجز بالمشروع",
        // Comp_Display_Words
        TYPE: "النوع",
        START_PRICE: "السعر الادنى",
        BUILT_UP_AREA: "متر",
        BEDROOMS: "غرفة",
        UNIT_TOTAL_PRICE: "السعر الكلي"
    },
    OPTIONS: {
        FINISHING: {
            0: "لم يتم الانتهاء",
            1: "منتهي بالكامل"
        }
    }
};
const Lang = {
    APP_NAME: "ادهم فتح الله",
    CANCEL: "الغاء",
    CLOSE: "اغلاق",
    ACCEPT: "قبول",
    UPDATE: "تحديث",
    SEARCH: "بحث",
    RESET: "مسح",
    SKIP: "تخطي",
    NEXT: "التالي",
    BACK: "السابق",
    LOGOUT: "تسجيل خروج",
    LOADING: "يرجي الانتظار...",
    FROM: "من",
    TO: "الي",
    SIDEBAR: Sidebar,
    DATE: {
        YESTERDAY: "أمس",
        TODAY: "اليوم"
    },
    TERMS: {
        TOP_TITLE: "الشروط والأحكام / سياسة الخصوصية",
        TOP_DESC: `مرحبًا بكم في موقع ${CompanyName}
               باستخدام هذا الموقع
               \n
               فإنك توافق على الامتثال للشروط والأحكام التالية.
               يرجى قراءتها بعناية قبل استخدام الموقع أو الاستفادة من أي من خدماتنا.
    `,
        TERMS_TITLE: "الشروط والأحكام",
        PRIVACY_TITLE: "الخصوصية والملكية الفكرية",
        CONTACT_TITLE: "تواصل معنا",
        PRIVACY: [
            {
                Id: 1,
                Label: "الملكية الفكرية",
                Content: `
        - الخدمات هي ملك لشركة ${CompanyName}. \n
        - لا يجوز لك استخدام أي من العلامات التجارية لشركة ${CompanyName} كجزء من اسم الشاشة أو عنوان البريد الإلكتروني الخاص بك على الخدمات. \n
        - لا تدعي شركة ${CompanyName} حقوق الطبع والنشر أو تمنح أي حقوق للصور أو الأوصاف الأساسية لقوائم العقارات المقدمة من خلال الخدمات. \n
        - أي استخدام لهذه الصور والأوصاف يخضع لإذن مالك حقوق الطبع والنشر و/أو لمتطلبات القانون المعمول به.
        `
            },
            {
                Id: 2,
                Label: "تحديد المسؤولية القانونية",
                Content: `
        - لن تكون شركة ${CompanyName} أو أي من مزوديها مسؤولين بأي حال من الأحوال عن أي أضرار، بما في ذلك على سبيل المثال لا الحصر، أي أضرار غير مباشرة أو تبعية أو خاصة أو عرضية أو تأديبية تنشأ عن أو تستند إلى أو تنتج عن شروط الاستخدام هذه أو الخدمات، حتى إذا تم إخطار هذا الطرف بإمكانية حدوث مثل هذه الأضرار. \n
        - يعتبر استبعاد الأضرار بموجب هذه الفقرة مستقلًا عن التعويض الحصري الخاص بك المحدد أدناه، ويظل ساريًا حتى في حالة فشل هذا التعويض في تحقيق غرضه الأساسي أو اعتباره غير قابل للتنفيذ.\n
        - تسري هذه القيود والاستثناءات بغض النظر عن ما إذا كانت الأضرار ناتجة عن (أ) خرق العقد، (ب) خرق الضمان، (ج) الإهمال، أو (د) أي سبب آخر للدعوى، إلى الحد الذي لا يحظره القانون المعمول به. \n
        - إذا كنت لا توافق على أي جزء من شروط الاستخدام هذه، أو إذا كان لديك أي نزاع أو مطالبة ضد ${CompanyName} أو مورديها فيما يتعلق بشروط الاستخدام هذه أو الخدمات، فإن التعويض الوحيد والحصري لك هو التوقف عن استخدام الخدمة.
        `
            },
            {
                Id: 3,
                Label: "التغييرات؛ التوقف",
                Content: `
        - تحتفظ شركة ${CompanyName} بالحق في تعديل شروط الاستخدام هذه في أي وقت وفقًا لتقديرها الخاص. \n
        - ستكون أي تغييرات سارية فور نشر النسخة المعدلة من شروط الاستخدام على موقع ${CompanyName}. \n
        - اإن استمرارك في استخدام الخدمات بعد فعالية هذه التغييرات سيعد قبولًا وموافقة على أي من هذه التغييرات. \n
        - كما أنك تتنازل عن أي حق قد يكون لديك في تلقي إشعار محدد بهذه التغييرات على شروط الاستخدام هذه. \n
        - أنت مسؤول عن مراجعة شروط الاستخدام هذه بانتظام. يحق لشركة ${CompanyName} تعديل أو تعليق أو إيقاف الخدمات في أي وقت لك و/أو للآخرين، دون إشعار. 
        `
            },
            {
                Id: 4,
                Label: "اختيار القانون؛ النزاعات",
                Content: `
            - تخضع شروط الاستخدام هذه لقوانين جمهورية مصر العربية، دون النظر في تعارضها مع أحكام القوانين.\n
            - توافق على الخضوع للاختصاص القضائي الحصري في المحاكم الموجودة في القاهرة، مصر فيما يتعلق بأي نزاعات أو مطالبات تنشأ عن أو تتعلق بالخدمات و/أو شروط الاستخدام هذه. \n
            - في أي نزاع ينشأ بموجب هذه الاتفاقية، يحق للطرف السائد الحصول على أتعاب المحاماة والتكاليف.
        `
            },
            {
                Id: 5,
                Label: "إخلاء المسؤولية",
                Content: `
            - تعفي شركة ${CompanyName} والشركات التابعة لها ومديريها ومسؤوليها وموظفيها ووكلائها من جميع المسؤوليات المتعلقة بأي مطالبات أو مطالبات قد تقدمها ضد أي طرف ثالث ناشئة عن الخدمات.
        `
            },
            {
                Id: 6,
                Label: "أحكام عامة",
                Content: `
            - توافق على عدم تصدير أي جزء من الخدمات المقدمة لك أو أي منتج مباشر منها من أي مكان إلا وفقًا لجميع التراخيص والموافقات المطلوبة بموجب قوانين ولوائح التصدير المعمول بها.
        `
            }
        ],
        CONDITIONS: [
            {
                Id: 1,
                Label: "القبول بالشروط",
                Content: `
            - من خلال الوصول إلى موقع ${CompanyName} واستخدامه، فإنك توافق على الالتزام الكامل بجميع الشروط والأحكام الموضحة أدناه.\n
            - إذا كنت لا توافق على أي جزء من هذه الشروط، يرجى التوقف عن استخدام الموقع فورًا
            `
            },
            {
                Id: 2,
                Label: "وصف الخدمات",
                Content: `
        ${CompanyName} هو موقع إلكتروني متخصص في تسويق العقارات. يشمل ذلك عرض العقارات للبيع  بالإضافة إلى توفير معلومات عن العروض العقارية للمشترين والمستثمرين.
        \n
        نحن نعمل كوسيط بين الأطراف المعنية في العمليات العقارية ولا نتحمل مسؤولية مباشرة عن أي معاملات تتم خارج نطاق خدماتنا.`
            },
            {
                Id: 3,
                Label: "الاستخدام المسموح به",
                Content: `
        - يُسمح لك باستخدام موقع ${CompanyName} لأغراض شخصية وغير تجارية فقط. \n
        - لا يجوز لك نسخ أو توزيع أو تعديل أي محتوى من الموقع دون إذن كتابي صريح من ${CompanyName}. \n
        - يجب عليك استخدام الموقع بطريقة قانونية وأخلاقية وعدم استخدامه في أي نشاط غير قانوني أو احتيالي أو ضار بالآخرين. \n
        - يُمنع استخدام الموقع لنشر أي محتوى غير لائق أو مضلل. 
    `
            },
            {
                Id: 4,
                Label: " التسجيل والحسابات",
                Content: `
            - قد يتطلب استخدام بعض خدمات الموقع إنشاء حساب. يجب أن تقدم معلومات دقيقة وكاملة عند التسجيل. \n
            - يجب أن تحافظ على سرية معلومات حسابك وكلمة المرور. أي استخدام غير مصرح به لحسابك هو مسؤوليتك. \n
            - لا يُسمح للأشخاص الذين تقل أعمارهم عن 18 عامًا بإنشاء حساب أو استخدام الموقع إلا بإذن قانوني من ولي أمرهم.
    
    `
            },
            {
                Id: 5,
                Label: "المحتوى المُقدم من المستخدمين",
                Content: `
        - عند تقديمك لأي محتوى إلى الموقع، بما في ذلك التعليقات أو المراجعات أو الصور أو البيانات العقارية، فإنك تمنح ${CompanyName} حقًا دائمًا وغير قابل للإلغاء لاستخدام هذا المحتوى وتوزيعه أو عرضه لأي غرض تجاري أو تسويقي. \n
        - يجب أن يكون أي محتوى تقدمه دقيقًا وخاليًا من أي مواد مخالفة للقانون، بما في ذلك حقوق الملكية الفكرية.
    
    `
            },
            {
                Id: 6,
                Label: " حقوق الملكية الفكرية",
                Content: `
        - جميع حقوق الملكية الفكرية المتعلقة بالموقع، بما في ذلك النصوص والصور والشعارات والتصاميم، هي ملكية حصرية لـ ${CompanyName} أو تم ترخيصها من قبل أطراف ثالثة. يُحظر إعادة استخدام هذه المواد دون الحصول على إذن مسبق. \n
        - استخدام الموقع لا يمنحك أي حقوق أو ملكية في المحتوى أو العلامات التجارية أو المواد الأخرى المرتبطة بالموقع.
        `
            },
            {
                Id: 7,
                Label: "إخلاء المسؤولية",
                Content: `
        - جميع المعلومات والمحتويات المقدمة على الموقع هي لأغراض إعلامية فقط ولا تشكل نصيحة مالية أو قانونية. \n
        - ${CompanyName} غير مسؤولة عن أي تعاملات عقارية تتم بين المستخدمين خارج الموقع أو دون إشراف مباشر منها. \n
        - لا تتحمل ${CompanyName} أي مسؤولية عن الأضرار الناتجة عن استخدام الموقع، سواء كانت مباشرة أو غير مباشرة.
        `
            },
            {
                Id: 8,
                Label: "الروابط الخارجية",
                Content: `
        - قد يحتوي موقع ${CompanyName} على روابط لمواقع خارجية. نحن لسنا مسؤولين عن محتوى أو سياسات الخصوصية لهذه المواقع. \n
        - استخدامك لهذه الروابط يكون على مسؤوليتك الخاصة، ويجب عليك مراجعة الشروط والأحكام الخاصة بتلك المواقع قبل استخدامها.
        `
            },
            {
                Id: 9,
                Label: "التعديلات على الشروط والأحكام",
                Content: `
        - تحتفظ ${CompanyName} بحق تعديل هذه الشروط والأحكام في أي وقت دون إشعار مسبق. \n
        - يتم إشعار المستخدمين بأي تغييرات جوهرية عن طريق نشر النسخة المعدلة على الموقع. '\n
        - استمرار استخدامك للموقع بعد إجراء أي تعديلات يعني موافقتك على الشروط الجديدة.
        `
            },
            {
                Id: 10,
                Label: "الخصوصية",
                Content: `
        - نحرص على حماية خصوصية المستخدمين. يتم جمع البيانات الشخصية فقط عند الضرورة، وذلك بما يتوافق مع سياسات الخصوصية الخاصة بنا. \n
        - لمزيد من التفاصيل حول كيفية استخدام وحماية بياناتك الشخصية، يرجى مراجعة سياسة الخصوصية الخاصة بنا.
        `
            },
            {
                Id: 11,
                Label: "المسؤولية القانونية",
                Content: `
        - تحتفظ ${CompanyName} بالحق في تعليق أو إنهاء حساب أي مستخدم إذا تم اكتشاف خرق لأي من الشروط والأحكام. \n
        - لا تتحمل ${CompanyName} المسؤولية عن أي نزاع أو مشكلة ناتجة عن التعاملات المالية أو العقارية بين الأطراف.
        `
            },
            {
                Id: 12,
                Label: "القانون المعمول به",
                Content: `
            تخضع هذه الشروط والأحكام لقوانين جمهورية مصر العربية. \n
            أي نزاع ينشأ عن استخدام الموقع أو هذه الشروط والأحكام سيتم حله أمام محاكم مصر.        
        `
            }
        ],
        CONTACT: [
            {
                Id: 1,
                Label: "",
                Content: `
        لأي استفسارات تتعلق بهذه الشروط والأحكام، يمكنك التواصل معنا عبر:
        - البريد الإلكتروني : info@afproperty.com
        - الهاتف : [ 𝟎𝟏𝟎𝟏𝟏𝟓𝟖𝟒𝟏𝟎𝟓 - 20+ ]
        `
            }
        ],
        BUTTONS: [
            {
                Label: "تواصل معنا",
                To: "#term-contact"
            },
            {
                Label: "الخصوصية والملكية الفكرية",
                To: "#privacy-policy"
            },
            {
                Label: "الشروط والأحكام",
                To: "#terms-and-conditions"
            }
        ]
    },
    ROOT_PAGE: {
        HERO: {
            START_BUTTON: "عرض المزيد",
            LOGIN_BUTTON: "تسجيل الدخول",
            CURVE_TEXT: "الحصول على عقاراتك"
        },
        ARTICALES: [
            {
                image: "/images/Home/1.png",
                title: "The secret of the{,}strength of dealing {,} with us.",
                description:
                    "For more than 14 years of experience in the real estate market, the connections, ties and relationships with the heads of departments of real estate development companies in the Egyptian market have increased, which allows us to deal with them in a smooth and simple way and use these relationships to achieve the greatest benefit for our customers who trust us in purchasing their new homes and pioneering investments. Adham Fathallah and his team work.  With great experience in respecting the rules of the relationship between its clients based on mutual interests while guaranteeing all their rights."
            },
            {
                image: "/images/Home/2.png",
                title: "one team",
                description:
                    "We always work to create distinguished cadres whose opinions and real estate consultations are reliable under the management and supervision of their president. With the increase in the percentage of our customers who trust us, it was necessary to develop and increase the number of employees in parallel with increasing the number of our customers for quick response and obtaining the best real purchasing experience. We also hope that you will be one of our customers and investors and we will guarantee  May your real estate holdings and investments succeed with us."
            },
            {
                image: "/images/Home/3.png",
                title: "Specialists and pioneers.",
                description:
                    "We always strive for innovation and development in our real estate field, and this is what made us specialize in studying real estate on a permanent basis and monitoring the events of the real estate market in particular and the economy in general, which makes us seize the best real estate opportunities available in that period. Our specialty. This is the secret of our strength, and we still have what we offer to our clients, and their success is part of our success.  This is the secret of their loyalty to us and their continuity with us."
            },
            {
                image: "/images/Home/4.png",
                title: "Our customer service.",
                description:
                    "With our team, we do not sell real estate to our clients. We buy them their homes as they wish for them and as they love them. We will be with you step by step until you get your new home in a completely safe and secure manner. We will be with you from A to Z."
            },
            {
                image: "/images/Home/5.png",
                title: "Super Support.",
                description:
                    "Adham Fathallah’s team consists of different departments that help each other achieve its goals and reach the highest possible efficiency and strength. Each department has its own specialty and study, which with its statistics helps us improve our important decisions for our customers. All Adham Fathallah’s departments work to achieve one goal, which is to satisfy you only."
            }
        ]
    },
    AUTH_PAGE: {
        TITLE: {
            Login: "تسجيل الدخول",
            Register: "حساب جديد",
            Forget: "نسيت كلمة المرور",
            Reset: "استعادة كلمة المرور",
            Verify: "تفعيل الحساب",
            OTP_1: "الكود المرسل على الواتساب",
            OTP_2: "رقم الواتساب : {{NUMBER}}"
        },
        MESSAGES: {
            MISMATCH_PASS: "حسابك غير مكتمل يرجي انشاء كلمة مرور",
            TERMS: "بانشاء حسابك ، فأنت توافق على",
            OTP: "جاري التحقق من البيانات يرجي الانتظار "
        },
        ASK: {
            FORGET: "نسيت كلمة المرور ؟",
            FORGET_PASS: "هل تريد استعادة كلمة المرور ؟"
        },
        BUTTONS: {
            LOGIN: "تسجيل الدخول",
            REGISTER: "انشاء حساب",
            FORGET: "نسيت كلمة المرور",
            RESEND: "اعادة ارسال الكود",
            NEW_ACCOUNT: "مستخدم جديد؟",
            HAVE_ACCOUNT: "لديك حساب ؟",
            HAVE_CODE: "لديك كود؟",
            HAVENT_CODE: "لا يوجد لديك كود ؟",
            TERMS: "شروط الاستخدام / سياسة الخصوصية"
        },
        ClientName: "اسم المستخدم",
        ClientPhoneNumber: "رقم الواتساب",
        ClientPhoneNumber2: "رقم الهاتف",
        ClientPassword: "كلمة المرور",
        ConfirmPassword: "تأكيد كلمة المرور",
        ClientCode: "كود التحقق"
    },
    CITIES_PAGE: {
        BEDROOMS_1: "غرفة",
        BEDROOMS_2: `الرجاء تحديد ${Sidebar.TITLE.BEDROOMS} أولاً`,
        BEDROOMS_3: "ما هو عدد الغرف الذي تبحث عنه ؟ يمكنك تحديد اكثر من اختيار",
        SUB_TYPES: "ما هو نوع وشكل الوحدة السكنية التي تبحث عنها؟",
        CHOSED: "لقد اخترت"
    },
    DATA_PAGE: {
        LAST_UPDATE: "آخر تحديث",
        DATA_COUNT: "هناك ( {{count}} ) مشروع تحتوي علي طلبك اكتشفها الآن",
        LE: "جنيه",
        STATUS_DATA: {
            1: "Available",
            2: "Launching",
            3: "Available", // Custom
            4: "Launching" // custom
        },
        STATUS_MESSAGES: {
            3: "المشروع حاليا فى المرحله الافتتاحية يرجى التواصل مع المسئول  من الشركة المطورة",
            4: " المشروع في المرحلة الافتتاحية الان \n للتفاصيل المتاحة يرجى التواصل بنا او مع الشركة المطورة.",
        },
        EXTRA_BENFITS: {
            1: "إيجار الإلزامي",
            2: "تفويض بالإيجار",
            3: "عائد عالمقدم",
            4: "عائد علي الأقساط"
        }
    },
    DETAIL_PAGE: {
        Brochure: "الكتيب",
        Contract: "العقد",
        MasterPlan: "الخطة الرئيسية",
        Photos: "الصور",
        CONTACT: "تواصل مع {{Name}}",
        PHONE_CHANGE_ASK: "إذا كنت بحاجة إلى تعديل رقمك، \n يرجى الاتصال بنا.",
        YOUR_PHONE: "هاتفك : {Phone}"
    },
    SETTINGS_PAGE: {
        TABS: {
            Profile: "الملف الشخصي",
            Status: "حالة الحساب"
        },
        STATUS: {
            STATUS: " : حالة الاتصال",
            true: "متصل",
            false: "غير متصل"
        }
    },
    ERRORS: {
        TRY_AGAIN: "حاول مرة اخرى",
        NOT_ALLOWED_POPUP:
            "تم حظر النافذة المنبثقة أو فشل تحويلك الي الرابط، إذا كنت تستخدم أي اكستنشن لمنع تحويل الصفحات ، فيرجى تعطيله لهذا الموقع",
        SERVER_ERROR: "حدث خطأ في الخادم",
        TOAST_TITLE: "حدث خطأ",
        PASS_NOT_MATCH_CONDITION: "كلمة المرور غير مطابقة للشروط",
        NAME_REQUIRED: "الاسم مطلوب",
        NAME_IS_SHORT: "الاسم قصير جدا",
        INVALID_USER_NAME: "اسم المستخدم غير صالح يرجي التأكد من ادخال الاسم بشكل صحيح",
        NUMBER_IS_NOT_VALID: "رقم الهاتف غير صالح يرجي التأكد من ادخال رقم الهاتف بشكل صحيح",
        PASSWORD_REQUIRED: "كلمة المرور مطلوبة ",
        PASSWORD_LENGTH: "كلمة المرور يجب ان تكون اكبر من او يساوي 6 حروف",
        PASSWORD_INVALID: "كلمة المرور يجب ان تكون ارقام وحروف",
        OLD_PASSWORD_REQUIRED: "كلمة المرور القديمة مطلوبة",
        PASSWORD_NOT_MATCH_CONFIRM: "كلمة المرور وتأكيد كلمة المرور غير متطابقين",
        INVALID_DETAIL_URL: "الرابط غير صالح جاري تحويلك الى صفحة البيانات",
        NO_IMAGE_FOUND: "لم يتم العثور على صورة",
        NO_MATRIALS: "لا يوجد ملفات متوفرة",
        CDN_UNAVILABLE:
            "نأسف ولكن عرض الملف غير متوفر ز يرجي الاتصال بالدعم بالكود التالي : 199404",
        NO_OPTIONS: "لا يوجد خيارات",
        ALLOWED_NUMBERS_ONLY: "يرجي ادخال ارقام فقط",
        FETCH_RETRY_ERROR: "حدث خطأ في جلب بيناتك"
    },
    PLACEHOLDER: {
        SELECT: "اختر"
        // SELECT: "Select ..."
    },
    LABEL: {
        INFO: "معلومات",
        SUCCESS: "عملية ناجحة",
        WARN: "تحذير",
        ERROR: "خطأ",
        OTP: "الرجاء ادخال الكود",
        PHONE_INPUT: "لم يتبق المزيد من الأحرف، يرجى التأكد من صحة رقمك مثال: {{ExNum}}",
        SELECTED: "{Count} محدد",
        Residential: "سكني",
        Commercial: "تجاري"
    },
    ROUTES: {
        Data: "البيانات",
        Detail: "التفاصيل",
        Home: "الرئيسية",
        Cities: "المدن",
        Settings: "الاعدادات",
        Terms: "الشروط والاحكام - سياسة الخصوصية"
        // Terms: "Terms & Conditions - Privacy Policy",
    }
};
export default Lang;
